Tekla.Structures.Datatype.Distance
The Distance datatype.
Remarks:
Tekla.Structures.Datatype.Distance stores, parses and formats distances in real world units.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
// Here we have an array of values in millimeters. These values may have come
// from the Tekla Structures Open API (which assumes all distances to be in
// millimeters) or from some other data source.
double[] valuesInMillimeters = { 30.2, 40, 20 };
// Here we have an array of values in inches. These may have come from the user
// interface or some other data source.
double[] valuesInInches = { 2, 4.5, 5 };
// For this demonstration, we convert the values into millimeters and store
// the sum of the distances into this array.
Distance[] distances = new Distance[3];
for(int i = 0; i < distances.Length; i++)
{
// The default unit type is millimeter.
Distance value1 = new Distance(valuesInMillimeters[i]);
// We need to explicitly define the unit type for inches.
Distance value2 = new Distance(valuesInInches[i], Distance.UnitType.Inch);
// To perform calculations, we need to use the same unit type for both
// distances. In this case, we use millimeters.
distances[i].Millimeters = value1.Millimeters + value2.Millimeters;
}
// While the Distance.ConvertTo method allows you to convert distances to other
// distance units, it is usually better to keep all distances as instances of
// Distance type and perform conversions only when absolutely necessary.
//
// Distance provides extensive support for formatting and parsing distances, so
// you usually need the conversion only when writing to some external data store.
//
// To demonstrate conversion, we assume that the distance values need to be
// converted to inches and stored in a database.
double[] valuesInInchesToStoreInDatabase = new double[3];
for(int i = 0; i < distances.Length; i++)
{
// We perform the conversion with the Distance.ConvertTo method just before
// storing the values. All other distances should be kept as instances of
// Distance type.
valuesInInchesToStoreInDatabase[i] = distances[i].ConvertTo(Distance.UnitType.Inch);
}
// For the next demonstration, we assume that the program wants to use inches for
// all distances. To do this, we set the current unit type. Current unit type
// should be treated like locale; set it only once at the start of the program.
Distance.CurrentUnitType = Distance.UnitType.Inch;
// Create new Distance instance. The default unit is millimeters, even if the
// current unit type is set to inches, so we still need to specify the unit type.
Distance distance = new Distance(5, Distance.UnitType.Inch);
// We have some distance in inches. This data may come from the user interface
// or some other data source.
double someDistanceInInches = 2;
// To perform calculations in inches, we use the Distance.Value property to
// get the distance in the current distance units. This way the program can
// set the unit type once (usually at the start) and use the unit type for
// all distances.
double sumOfDistancesInInches = someDistanceInInches + distance.Value;
// If the current unit type is changed during the run time, the above
// calculation might use mismatching units and return incorrect result.
// To prevent this, follow these simple rules:
// 1) Use Distance type for all distances, specifying the unit when converting from plain values.
Distance someDistance = new Distance(someDistanceInInches, Distance.UnitType.Inch);
// 2) Perform calculations using the Distance.Millimeters property.
Distance sumOfDistances = new Distance(someDistance.Millimeters + someDistance.Millimeters);
}
}

Tekla.Structures.Datatype.Distance.#ctor(System.Double)
Initializes a new instance of the structure.
millimeters: The distance in millimeters.
This example shows how to construct a new Tekla.Structures.Datatype.Distance instance.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
Distance distance = new Distance(30.2);
}
}

Tekla.Structures.Datatype.Distance.#ctor(System.Double,Tekla.Structures.Datatype.Distance.UnitType)
Initializes a new instance of the structure.
distance: The distance in the specified units.
unitType: The distance unit type.
Throws System.ArgumentException: Thrown if an invalid unit type is specified.
This example shows how to construct a new Tekla.Structures.Datatype.Distance instance with a specific unit type.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
Distance distance = new Distance(2, Distance.UnitType.Inch);
}
}

Tekla.Structures.Datatype.Distance.GetHashCode
Returns the hash code for the current instance.
Returns: A 32-bit signed integer that is the hash code for the current instance.

Tekla.Structures.Datatype.Distance.Equals(System.Object)
Indicates whether the current instance and the specified object are equal.
obj: The object to be compared with the current object.
Returns: True if the specified object and the current instance are of the same type and represent the same value; otherwise, false.

Tekla.Structures.Datatype.Distance.Equals(Tekla.Structures.Datatype.Distance)
Indicates whether the current object is equal to another object of the same type.
other: The object to be compared with the current object.
Returns: True if the current object is equal to the other object; otherwise, false.

Tekla.Structures.Datatype.Distance.CompareTo(Tekla.Structures.Datatype.Distance)
Compares the current object with another object of the same type.
other: The object to be compared with the current object.
Returns:
A 32-bit signed integer that indicates the relative order of the objects being compared.
The return value has the following meanings:
Value
Meaning
Less than zero
The current object is less than the other object.
Zero
The current object is equal to the other object.
Greater than zero
The current object is greater than the other object.

Tekla.Structures.Datatype.Distance.ConvertTo(Tekla.Structures.Datatype.Distance.UnitType)
Converts the distance to the specified units.
unitType: The distance unit type.
Returns: The distance in the specified units.
This example shows how to convert a Tekla.Structures.Datatype.Distance instance into real
world units.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
// For this demonstration, we'll format 300.2 millimeters.
Distance distance = new Distance(300.2);
double distanceInInches = distance.ConvertTo(Distance.UnitType.Inch);
}
}

Tekla.Structures.Datatype.Distance.FromDecimalString(System.String)
Creates a distance from a decimal string representation.
text: The distance string.
Returns: The representation of the specified distance.
Throws System.FormatException: Thrown if the text does not represent a distance.
This example shows how to parse a Tekla.Structures.Datatype.Distance instance from a decimal
string.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
Distance distance = Distance.FromDecimalString("3");
}
}

Tekla.Structures.Datatype.Distance.FromDecimalString(System.String,System.IFormatProvider)
Creates a distance from a decimal string representation.
text: The distance string.
formatProvider: The number format provider.
Returns: The representation of the specified distance.
Throws System.FormatException: Thrown if the text does not represent a distance.
This example shows how to specify a format provider when parsing a
Tekla.Structures.Datatype.Distance instance from a decimal string.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
public void Example1()
{
Distance distance = Distance.FromDecimalString("3.2", CultureInfo.InvariantCulture);
}
}

Tekla.Structures.Datatype.Distance.FromDecimalString(System.String,System.IFormatProvider,Tekla.Structures.Datatype.Distance.UnitType)
Creates a distance from a decimal string representation.
text: The distance string.
formatProvider: The number format provider.
unitType: The unit type of the distance to parse.
Returns: The representation of the specified distance.
Throws System.FormatException: Thrown if the text does not represent a distance.
Throws System.ArgumentException: Thrown if an invalid unit type is specified.
This example shows how to specify a format provider and a unit type when parsing a
Tekla.Structures.Datatype.Distance instance from a decimal string.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
public void Example1()
{
Distance distance = Distance.FromDecimalString("3.2", CultureInfo.InvariantCulture, Distance.UnitType.Inch);
}
}

Tekla.Structures.Datatype.Distance.ToDecimalString
Converts the distance to a decimal string representation.
Returns: The string representation of the distance.
This example shows how to convert a Tekla.Structures.Datatype.Distance instance into a
decimal string.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
// For this demonstration, we'll format 300.2 millimeters.
Distance distance = new Distance(300.2);
string formattedString = distance.ToDecimalString();
}
}

Tekla.Structures.Datatype.Distance.ToDecimalString(System.String)
Converts the distance to a decimal string representation.
format: The format string.
Returns: The string representation of the distance.
This example shows how to specify a number format when converting a
Tekla.Structures.Datatype.Distance instance into a decimal string.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
// For this demonstration, we'll format 300.2 millimeters.
Distance distance = new Distance(300.2);
string formattedString = distance.ToDecimalString("0.00");
}
}

Tekla.Structures.Datatype.Distance.ToDecimalString(System.IFormatProvider)
Converts the distance to a decimal string representation.
formatProvider: The number format provider.
Returns: The string representation of the distance.
This example shows how to specify a format provider when converting a
Tekla.Structures.Datatype.Distance instance into a decimal string.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
public void Example1()
{
// For this demonstration, we'll format 300.2 millimeters.
Distance distance = new Distance(300.2);
string formattedString = distance.ToDecimalString(CultureInfo.InvariantCulture);
}
}

Tekla.Structures.Datatype.Distance.ToDecimalString(System.String,System.IFormatProvider)
Converts the distance to a decimal string representation.
format: The format string.
formatProvider: The number format provider.
Returns: The string representation of the distance.
This example shows how to specify a number format and a format provider when
converting a Tekla.Structures.Datatype.Distance instance into a decimal string.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
public void Example1()
{
// For this demonstration, we'll format 300.2 millimeters.
Distance distance = new Distance(300.2);
string formattedString = distance.ToDecimalString("0.00", CultureInfo.InvariantCulture);
}
}

Tekla.Structures.Datatype.Distance.ToDecimalString(System.String,System.IFormatProvider,Tekla.Structures.Datatype.Distance.UnitType)
Converts the distance to a decimal string representation.
format: The format string.
formatProvider: The number format provider.
unitType: The unit type.
Returns: The string representation of the distance.
Throws System.ArgumentException: Thrown if an invalid unit type is specified.
This example shows how to specify a number format, a format provider and a unit
type when converting a Tekla.Structures.Datatype.Distance instance into a decimal string.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
public void Example1()
{
Distance.UseUnitsInDecimalString = true;
// For this demonstration, we'll format 300.2 millimeters.
Distance distance = new Distance(300.2);
// Even if the UseFractionalFormat is set to true, we can still get the decimal representation.
string decimalString = distance.ToDecimalString("0.00", CultureInfo.InvariantCulture, Distance.UnitType.Inch);
}
}

Tekla.Structures.Datatype.Distance.FromFractionalFeetAndInchesString(System.String)
Creates a distance from a string representation of fractional feet and inches.
text: The distance string.
Returns: The representation of the specified distance.
Throws System.FormatException: Thrown if the text does not represent a distance.
This example shows how to parse a Tekla.Structures.Datatype.Distance instance from a fractional
string representation of feet and inches.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
Distance distance = Distance.FromFractionalFeetAndInchesString("3' 3/4");
}
}

Tekla.Structures.Datatype.Distance.FromFractionalFeetAndInchesString(System.String,System.IFormatProvider,Tekla.Structures.Datatype.Distance.UnitType)
Creates a distance from a string representation of fractional feet and inches.
text: The distance string.
formatProvider: The number format provider.
unitType: The unit type of the distance to parse.
Returns: The representation of the specified distance.
Throws System.FormatException: Thrown if the text does not represent a distance.
This example shows how to specify a format provider and a unit type when parsing
a Tekla.Structures.Datatype.Distance instance from a fractional string representation of
feet and inches.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
public void Example1()
{
Distance distance = Distance.FromFractionalFeetAndInchesString("3' 3/4", CultureInfo.InvariantCulture, Distance.UnitType.Inch);
}
}

Tekla.Structures.Datatype.Distance.ToFractionalFeetAndInchesString
Creates a string representation of the distance in feet and inches.
Returns: The string representation of the distance.
This example shows how to convert a Tekla.Structures.Datatype.Distance instance into a
fractional string representation of feet and inches.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
// For this demonstration, we'll format 300.2 millimeters.
Distance distance = new Distance(300.2);
string formattedString = distance.ToFractionalFeetAndInchesString();
}
}

Tekla.Structures.Datatype.Distance.ToFractionalFeetAndInchesString(System.IFormatProvider)
Creates a string representation of the distance in feet and inches.
formatProvider: The number format provider.
Returns: The string representation of the distance.
This example shows how to specify a format provider when converting a
Tekla.Structures.Datatype.Distance instance into a fractional string representation
of feet and inches.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
public void Example1()
{
// For this demonstration, we'll format 300.2 millimeters.
Distance distance = new Distance(300.2);
string formattedString = distance.ToFractionalFeetAndInchesString(CultureInfo.InvariantCulture);
}
}

Tekla.Structures.Datatype.Distance.ToFractionalInchesString
Creates a string representation of the distance in inches.
Returns: The string representation of the distance.
This example shows how to convert a Tekla.Structures.Datatype.Distance instance into a
fractional string representation of inches.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
// For this demonstration, we'll format 300.2 millimeters.
Distance distance = new Distance(300.2);
string formattedString = distance.ToFractionalInchesString();
}
}

Tekla.Structures.Datatype.Distance.ToFractionalInchesString(System.IFormatProvider)
Creates a string representation of the distance in inches.
formatProvider: The number format provider.
Returns: The string representation of the distance.
This example shows how to specify a format provider when converting a
Tekla.Structures.Datatype.Distance instance into a fractional string representation
of inches.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
public void Example1()
{
// For this demonstration, we'll format 300.2 millimeters.
Distance distance = new Distance(300.2);
string formattedString = distance.ToFractionalInchesString(CultureInfo.InvariantCulture);
}
}

Tekla.Structures.Datatype.Distance.Parse(System.String)
Parses a distance from a string representation using the current unit type and culture.
text: The text to parse.
Returns: The representation of the specified distance.
Throws System.FormatException: Thrown if the text does not represent a distance.
This example shows how to parse a Tekla.Structures.Datatype.Distance instance from a string.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
Distance distance = Distance.Parse("3");
}
}

Tekla.Structures.Datatype.Distance.Parse(System.String,System.IFormatProvider)
Parses a distance from a string representation using the current unit type and the given culture.
text: The text to parse.
formatProvider: The number format provider.
Returns: The representation of the specified distance.
Throws System.FormatException: Thrown if the text does not represent a distance.
This example shows how to specify a format provider when parsing a
Tekla.Structures.Datatype.Distance instance from a string.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
public void Example1()
{
// Current unit type controls the default unit type used in parsing.
// The default unit is millimeter.
Distance.CurrentUnitType = Distance.UnitType.Millimeter;
// Tekla Structures uses dot as the decimal separator in all locales.
// This will be parsed as 30.2 millimeters.
Distance distanceInMillimeters = Distance.Parse("30.2", CultureInfo.InvariantCulture);
// If the distance contains the unit, the distance is converted automatically.
// This will be parsed as 30.2 meters.
Distance distanceInMeters = Distance.Parse("30.2m", CultureInfo.InvariantCulture);
}
}

Tekla.Structures.Datatype.Distance.Parse(System.String,System.IFormatProvider,Tekla.Structures.Datatype.Distance.UnitType)
Parses a distance from a string representation using the given unit type and culture.
text: The text to parse.
formatProvider: The number format provider.
unitType: The unit type of the distance to parse. Determines the parsing process.
Returns: The representation of the specified distance.
Throws System.FormatException: Thrown if the text does not represent a distance.
Throws System.ArgumentException: Thrown if an invalid unit type is specified.
This example shows how to specify a format provider and a unit type when parsing
a Tekla.Structures.Datatype.Distance instance from a string.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
public void Example1()
{
// We can override the current unit type to force the parsing to perform automatic unit conversion.
// This will be parsed as 3.2 inches.
Distance distanceInInches = Distance.Parse("3.2", CultureInfo.InvariantCulture, Distance.UnitType.Inch);
// When using feet or inches as the distance unit, the fractional format is supported as well.
// This will be parsed as 3/4 inches.
Distance InchesInFractionalFormat = Distance.Parse("3/4", CultureInfo.InvariantCulture, Distance.UnitType.Inch);
}
}

Tekla.Structures.Datatype.Distance.TryParse(System.String,Tekla.Structures.Datatype.Distance@)
Attempts to parse a distance from a string representation using the current units.
text: The text to parse.
result: The output variable for the result.
Returns: A boolean value indicating whether the operation succeeded.
This example shows how to attempt to parse a Tekla.Structures.Datatype.Distance instance
from a string.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
Distance.CurrentUnitType = Distance.UnitType.Millimeter;
// If the string can not be parsed, an exception is thrown. To prevent the
// exception we can use the Distance.TryParse instead. We'll use this variable
// to hold the parsed value.
Distance distance;
// Distance.TryParse works just like the Distance.Parse method, except the method
// returns a boolean value indicating whether the string was parsed and takes an
// output variable for holding the result.
bool parsed = Distance.TryParse("3", out distance);
}
}

Tekla.Structures.Datatype.Distance.TryParse(System.String,System.IFormatProvider,Tekla.Structures.Datatype.Distance@)
Attempts to parse a distance from a string representation using the current units.
text: The text to parse.
formatProvider: The number format provider.
result: The output variable for the result.
Returns: A boolean value indicating whether the operation succeeded.
This example shows how to specify a format provider when attempting to parse
a Tekla.Structures.Datatype.Distance instance from a string.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
public void Example1()
{
Distance.CurrentUnitType = Distance.UnitType.Millimeter;
// If the string can not be parsed, an exception is thrown. To prevent the
// exception we can use the Distance.TryParse instead. We'll use this variable
// to hold the parsed value.
Distance distance;
// Distance.TryParse works just like the Distance.Parse method, except the method
// returns a boolean value indicating whether the string was parsed and takes an
// output variable for holding the result.
bool parsed = Distance.TryParse("30.2", CultureInfo.InvariantCulture, out distance);
}
}

Tekla.Structures.Datatype.Distance.TryParse(System.String,System.IFormatProvider,Tekla.Structures.Datatype.Distance.UnitType,Tekla.Structures.Datatype.Distance@)
Attempts to parse a distance from a string representation using the current units.
text: The text to parse.
formatProvider: The number format provider.
defaultUnitType: The default unit type if the unit cannot be determined.
result: The output variable for the result.
Returns: A boolean value indicating whether the operation succeeded.
Throws System.ArgumentException: Thrown if an invalid unit type is specified.
This example shows how to specify a format provider and a unit type when
attempting to parse a Tekla.Structures.Datatype.Distance instance from a string.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
public void Example1()
{
Distance.CurrentUnitType = Distance.UnitType.Millimeter;
// If the string can not be parsed, an exception is thrown. To prevent the
// exception we can use the Distance.TryParse instead. We'll use this variable
// to hold the parsed value.
Distance distance;
// Distance.TryParse works just like the Distance.Parse method, except the method
// returns a boolean value indicating whether the string was parsed and takes an
// output variable for holding the result.
bool parsed = Distance.TryParse("30.2", CultureInfo.InvariantCulture, Distance.UnitType.Inch, out distance);
}
}

Tekla.Structures.Datatype.Distance.ToString
Creates a string representation of the distance.
Returns: The string representation of the distance using CultureInfo.InvariantCulture.
This example shows how to convert a Tekla.Structures.Datatype.Distance instance to a string.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
// For this demonstration, we'll format 300.2 millimeters.
Distance distance = new Distance(300.2);
// The default format uses the current unit type, current culture info and default number format.
string formattedString = distance.ToString();
}
}

Tekla.Structures.Datatype.Distance.ToString(System.String)
Creates a string representation of the distance.
format: The format string.
Returns: The string representation of the distance.
This example shows how to specify a number format when converting a
Tekla.Structures.Datatype.Distance instance to a string.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
// For this demonstration, we'll format 300.2 millimeters.
Distance distance = new Distance(300.2);
// We can use the number format string to specify the precision. In this case, we use two decimal places.
string formattedString = distance.ToString("0.00");
}
}

Tekla.Structures.Datatype.Distance.ToString(System.IFormatProvider)
Creates a string representation of the distance.
formatProvider: The number format provider.
Returns: The string representation of the distance.
This example shows how to specify a format provider when converting a
Tekla.Structures.Datatype.Distance instance to a string.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
public void Example1()
{
// For this demonstration, we'll format 300.2 millimeters.
Distance distance = new Distance(300.2);
// Tekla Structures uses dot as the decimal separator in all locales.
string formattedString = distance.ToString(CultureInfo.InvariantCulture);
}
}

Tekla.Structures.Datatype.Distance.ToString(System.String,System.IFormatProvider)
Creates a string representation of the distance.
format: The format string.
formatProvider: The number format provider.
Returns: The string representation of the distance.
This example shows how to specify a number format and a format provider when
converting a Tekla.Structures.Datatype.Distance instance to a string.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
public void Example1()
{
// For this demonstration, we'll format 300.2 millimeters.
Distance distance = new Distance(300.2);
string formattedString = distance.ToString("0.00", CultureInfo.InvariantCulture);
}
}

Tekla.Structures.Datatype.Distance.ToString(System.String,System.IFormatProvider,Tekla.Structures.Datatype.Distance.UnitType)
Creates a string representation of the distance.
format: The format string.
formatProvider: The number format provider.
unitType: The unit type.
Returns: The string representation of the distance.
Throws System.ArgumentException: Thrown if an invalid unit type is specified.
This example shows how to specify a number format, a format provider and a unit
type when converting a Tekla.Structures.Datatype.Distance instance to a string.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
public void Example1()
{
// For this demonstration, we'll format 300.2 millimeters.
Distance distance = new Distance(300.2);
// We can override the unit type to display the distance in inches.
string defaultFormatInInches = distance.ToString(null, null, Distance.UnitType.Inch);
// With the number format and culture info we can get fully customized representation.
string customizedFormatInInches = distance.ToString("0.00", CultureInfo.InvariantCulture,
Distance.UnitType.Inch);
}
}

Tekla.Structures.Datatype.Distance.ParseFractionalDouble(System.String,System.IFormatProvider,Tekla.Structures.Datatype.Distance.UnitType)
Parses a fractional representation of a double precision floating point number.
text: The text to parse.
formatProvider: The number format provider.
unitType: The unit type to parse to.
Returns: The parsed double value.
Throws System.FormatException: Thrown if the text does not represent a double value.

Tekla.Structures.Datatype.Distance.ConvertToMillimeters(System.Double,Tekla.Structures.Datatype.Distance.UnitType)
Converts the specified distance units to millimeters.
distance: The distance in specified units.
unitType: The distance unit type.
Returns: The converted distance.
Throws System.ArgumentException: Thrown if an invalid unit type is specified.

Tekla.Structures.Datatype.Distance.ConvertMillimetersTo(System.Double,Tekla.Structures.Datatype.Distance.UnitType)
Converts millimeters to the specified distance units.
millimeters: The distance in millimeters.
unitType: The target unit type.
Returns: The converted distance.
Throws System.ArgumentException: Thrown if an invalid unit type is specified.

Tekla.Structures.Datatype.Distance.ParseNumberAsInt(System.String,System.Globalization.NumberStyles,System.IFormatProvider)
Try and parse the number string into integer.
value: The string value to be parsed.
style: The number style.
format: The format provider.
Returns: The parsed integer value as a Tekla.Structures.Datatype.Double.

Tekla.Structures.Datatype.Distance.ParseNumberAsDouble(System.String,System.Globalization.NumberStyles,System.IFormatProvider)
Parse number as double.
value: The string value to be parsed.
style: The number style.
format: The format provider.
Returns: The parsed value as a Tekla.Structures.Datatype.Double.

Tekla.Structures.Datatype.Distance.CurrentUnitType
Gets or sets the current unit type.
The current unit type.
This example shows how to specify the current unit type.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
public void Example1()
{
// Current unit type controls the default unit type used in parsing.
Distance.CurrentUnitType = Distance.UnitType.Millimeter;
Distance distance = Distance.Parse("30.2", CultureInfo.InvariantCulture);
}
}

Tekla.Structures.Datatype.Distance.UseUnitsInDecimalString
Gets or sets a boolean value indicating whether to use units in the decimal string representation.
Indicates whether to use units in the decimal string representation.
This example shows how to use the UseUnitsInDecimalString property.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
public void Example1()
{
// UseUnitsInDecimalString controls whether the unit type is shown in the decimal string representation.
Distance.UseUnitsInDecimalString = true;
// For this demonstration, we'll format 300.2 millimeters.
Distance distance = new Distance(300.2);
string formattedString = distance.ToDecimalString("0.00", CultureInfo.InvariantCulture);
}
}

Tekla.Structures.Datatype.Distance.UseFractionalFormat
Gets or sets a boolean value indicating whether to use the fractional format for US imperial units.
Indicates whether to use the fractional format for US imperial units.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
public void Example1()
{
// UseFractionalFormat controls whether the feet and inches are formatted using the fractional representation.
Distance.UseFractionalFormat = true;
// For this demonstration, we'll format 300.2 millimeters.
Distance distance = new Distance(300.2);
string formattedString = distance.ToString("0.00", CultureInfo.InvariantCulture, Distance.UnitType.Inch);
}
}

Tekla.Structures.Datatype.Distance.Millimeters
Gets or sets the distance in millimeters.
The distance in millimeters.
This example shows how to perform calculations with distances in different units.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
// The default unit type is millimeter.
Distance value1 = new Distance(30);
// Other unit types must be specified explicitly.
Distance value2 = new Distance(2, Distance.UnitType.Inch);
// Perform sum calculation using millimeters for both distances.
Distance sumOfDistances = new Distance(value1.Millimeters + value2.Millimeters);
}
}

Tekla.Structures.Datatype.Distance.Value
Gets or sets the distance value in current units.
The distance value in current units.
This example shows how to perform calculations with distances in different units.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
// The default unit type is millimeter.
Distance value1 = new Distance(30);
// Other unit types must be specified explicitly.
Distance value2 = new Distance(2, Distance.UnitType.Inch);
// Perform sum calculation using the same units for both distances.
Distance sumOfDistances = new Distance(value1.Value + value2.Value, Distance.CurrentUnitType);
}
}

Tekla.Structures.Datatype.Distance.DecimalPlaces
Gets the number of decimal places used for distances.
Number of decimal places used for distances.

Tekla.Structures.Datatype.Distance.FeetPerInch
Conversion factor from inches to feet.

Tekla.Structures.Datatype.Distance.InchesPerFoot
Conversion factor from feet to inches.

Tekla.Structures.Datatype.Distance.InchesPerMillimeter
Conversion factor from millimeters to inches.

Tekla.Structures.Datatype.Distance.MillimetersPerInch
Conversion factor from inches to millimeters.

Tekla.Structures.Datatype.Distance.Fractions
Maximum Fractions of an inch.

Tekla.Structures.Datatype.Distance.decimalNumberFormat
Decimal number format.

Tekla.Structures.Datatype.Distance.fractionalNumberFormat
Fractional number formats.

Tekla.Structures.Datatype.Distance.fractionalFeetAndInchesFormat
Fractional US imperial formats.

Tekla.Structures.Datatype.Distance.useUnitsInDecimalString
Indicates whether to use units in decimal string representation.

Tekla.Structures.Datatype.Distance.useFractionalFormat
Indicates whether to use fractional format for US imperial units.

Tekla.Structures.Datatype.Distance.millimeters
Distance in millimeters.

Tekla.Structures.Datatype.Distance.GetSchema


Tekla.Structures.Datatype.Distance.GetXmlElement(System.Xml.XmlReader)


Tekla.Structures.Datatype.Distance.ReadXml(System.Xml.XmlReader)


Tekla.Structures.Datatype.Distance.MILLIMETERS


Tekla.Structures.Datatype.Distance.WriteXml(System.Xml.XmlWriter)
